
let allBooks = [
    {
        id: 1,
        author: 'مایکل هستینگز',
        price: 235_000,
        image: '/images/popular-image/cart__img.png',
        category: 'popular_books',
        count: 0,
        summary: 'کتاب "ژنرال‌ها" نوشتهٔ مایکل هستینگز، یک تحلیل جذاب از سازمان‌ها و رهبری در دنیای نظامی است. این کتاب به مطالعه‌کنندگان برای درک بهتر اصول مدیریت و تصمیم‌گیری در شرایط پیچیده و بحرانی کمک می‌کند.',
        search_key: 'مدیریت نظامی '

    },
    {
        id: 2,
        author: 'خوان دیوید نازیو',
        price: 399_000,
        image: '/images/popular-image/cart__img2.png',
        category: 'popular_books',
        count: 0,
        summary: `کتاب "پنج درس در تئوری روان‌کاوی ژاک لاکان" نوشتهٔ خوان دیوید نازیو، به مفاهیم پایه تئوری روان‌کاوی ژاک لاکان پرداخته و در زمینه‌هایی نظیر هویت، زبان، و نقش اشیاء در تحلیل روان‌کاوی توضیحاتی ارائه می‌دهد. این کتاب به‌صورت خلاصه می‌تواند به این شکل باشد:
        "کتاب "پنج درس در تئوری روان‌کاوی ژاک لاکان" از نگاه نویسنده، مفاهیم پیچیده ژاک لاکان را در خمینه‌های مختلف مورد بررسی قرار می‌دهد. خوان دیوید نازیو به ما درس‌هایی ارزشمند از تئوری روان‌کاوی لاکانی ارائه می‌دهد، به‌ویژه در زمینه‌های هویت، زبان، و تأثیر اشیاء در روان‌کاوی. این کتاب برای علاقه‌مندان به روان‌کاوی و فهم عمیق‌تر مباحث لاکانی توصیه می‌شود."`,
        search_key: '#روان کاوی# نقش اشیا# مباحث لاکانی'

    },
    {
        id: 3,
        author: 'هومن شمس',
        price: 250_000,
        image: '/images/popular-image/cart__img3.png',
        category: 'popular_books',
        count: 0,
        summary: `کتاب "حکایت نخبگان روی اعصاب" نوشتهٔ هومن شمس، یک رمان تازه‌نویسی است که داستان عشق، هنر، و روابط انسانی را در جامعه‌ای که تحت فشارهای اجتماعی و فرهنگی قرار دارد، بازگو می‌کند. در این کتاب، داستان دو شخصیت اصلی به نام‌های "آتری" و "آیلین" که در میانهٔ زندگی به تدریج به نخبگان جامعه تبدیل می‌شوند، روایت می‌شود. آن‌ها با چالش‌ها و تضادهای زندگی خود درگیر می‌شوند و تجربیات شخصی و اجتماعی خود را تجسم می‌کنند.
        "حکایت نخبگان روی اعصاب" تلاشی برای توصیف روان‌شناسی و انسان‌شناسی معاصر و نقش هنر و ادب در تحولات جامعه است. این کتاب تصویری عمیق و زیبا از زندگی نخبگان و تحولات داستانی آن‌ها را ارائه می‌دهد و مخاطبان را به فکر و تأمل در موضوعات اجتماعی و فرهنگی می‌اندازد.`,
        search_key: 'تجربیات شخصی تضاد زندگی اجتماعی فرهنگی'
    },
    {
        id: 4,
        author: 'ایگناسیورامونت',
        price: 197_000,
        image: '/images/popular-image/cart__img6.png',
        category: 'popular_books',
        count: 0,
        summary: `کتاب "تاریخ جهان به روایت فیدل کاسترو: صد ساعت با فیدل، زندگی و خاطرات فیدل کاسترو" از مصاحبات و خاطرات فیدل کاسترو، رهبر کوبا، روایت می‌کند. این کتاب به موارد زیر تمرکز دارد:
        1. زندگی فیدل کاسترو: کتاب به بررسی زندگی پرفراز و نشیب رهبر کوبا، فیدل کاسترو، پرداخته و تصویری شخصی از زندگی او ارائه می‌دهد.
        2. تأثیرات فیدل کاسترو: کتاب به تأثیرات و نقش فیدل کاسترو در رویدادهای جهانی و تاریخ سیاسی کوبا می‌پردازد و به تحلیل دقیق از اعمال و نیروهای او می‌پردازد.
        3. مصاحبات خاص: این کتاب به مصاحبات خاصی که با فیدل کاسترو انجام شده است می‌پردازد و برخی از ارتباطات شخصی و تعاملات او را با دیگر شخصیت‌ها و سیاست‌مداران بین‌المللی نیز مورد تجزیه و تحلیل قرار می‌دهد.`,
        search_key: 'رهبر کوبا سیاست'
    },
    {
        id: 5,
        author: 'ادموند ویلسون',
        price: 190_000,
        image: '/images/popular-image/cart__img7.png',
        category: 'popular_books',
        count: 0,
        summary: `کتاب "به سوی ایستگاه فنلاند" اثر ادموند ویلسون، یک کتاب معروف است که در آن نویسنده به مسائل سیاسی و اجتماعی آمریکا می‌پردازد. در این کتاب، ادموند ویلسون به اصول دموکراسی و آزادی فرهنگی پرداخته و نقدهایی به نقش آمریکا در جهان ارائه می‌دهد. او تأکید می‌کند که آمریکا باید نقش مؤثری در تعیین سیاست‌های جهانی بازی کند. این کتاب در دههٔ ۱۹۱۰ منتشر شده و به شدت تأثیرگذار بر روی تاریخ سیاسی و اجتماعی آمریکا بوده است.`,
        search_key: 'تاریخ سیاسی اجتماعی آمریکا دموکراسی'
    },
    {
        id: 6,
        author: 'صادق هدایت',
        price: 120_000,
        image: '/images/popular-image/cart__img_sadegh_hedayat.png',
        category: 'popular_books',
        count: 0,
        summary: `صادق هدایت (1903-1987)، یکی از نویسندگان بزرگ ادبیات ایران در قرن بیستم بود. او کتاب‌های متعددی نوشت که از جمله آثار مهم و معروف او می‌توان به "بوف کور" اشاره کرد. "بوف کور" کتابی است که از نظر سیاق و ساختار ادبی و نمایشگری متمایز است. این کتاب داستانی از دوران مشروطیت در ایران است و نگاهی تلخ به جامعه و مسائل اجتماعی و سیاسی آن دوران دارد.`,
        search_key: ' اجتماعی سیاسی مشروطیت'
    },
    {
        id: 7,
        author: 'اندرو لدربارو',
        price: 139_000,
        image: '/images/new-books-image/cart__img_chernobil.png',
        category: 'new_books',
        count: 0,
        summary: `کتاب "چرنوبیل: تاریخ ناپدید شده" نوشتهٔ اندرو لدربر به بررسی حادثه‌ی انفجار نیروگاه هسته‌ای چرنوبیل در سال 1986 و تأثیرات آن بر جوامع و محیط زیست می‌پردازد. این کتاب به‌صورت دقیق و جامع تاریخچه حادثه، نقش دولت سوسیالیستی سابق شوروی در مدیریت بحران، تلاش‌های انسانی برای مهار انتشار پرتوهای مضر و تأثیرات طولانی‌مدت بر ساکنان و منطقه چرنوبیل را شرح می‌دهد.
        کتاب "چرنوبیل: تاریخ ناپدید شده" از دقت تاریخی و تحلیل علمی برخوردار است و به خواننده‌ها نگاهی عمیق و جامع به یکی از بزرگترین حوادث هسته‌ای تاریخ ارائه می‌دهد. این کتاب به‌طور گسترده مورد تقدیر و تحسین قرار گرفته و به عنوان یکی از مهم‌ترین منابع مربوط به حادثه‌ی چرنوبیل شناخته می‌شود.`,
        search_key: 'تاریخی  سیاسی'
    },
    {
        id: 8,
        author: 'کارل گوستاویونگ',
        price: 289_000,
        image: '/images/new-books-image/cart__img_man_nashenakhteh.png',
        category: 'new_books',
        count: 0,
        summary: `بله، کارل گوستاو يونگ یکی از نویسندگان و روانشناسان معروف قرن بیستم بود. او به عنوان یکی از بنیان‌گذاران روان‌شناسی تحلیلی شناخته می‌شود. جیمز هیلمن از جمله آثار او می‌توان به کتاب "نفس انسان و نفس انسانیت" (Man and His Symbols) اشاره کرد که به همراه همکارانش نوشته شده است. این کتاب به تفسیر نمادها و علائم در روانشناسی و روان‌شناسی تحلیلی می‌پردازد.
        کارل گوستاو یونگ از پیشوایان جریان پسیخودروانی و به توسعه نظریاتی مبتنی بر تحلیل عمیق نفس و نمادها معروف بود. او تأکید می‌کرد که درک افراد از خود و تعامل با عمق نفسی خود می‌تواند به شفافیت و تعادل روحی کمک کند. او به مفاهیمی چون آرژی‌تیپ‌ها، کمپلکس‌ها و تقابل‌های روحی معروف بود.
        کارل گوستاو یونگ از جمله شخصیت‌های برجسته در زمینه روانشناسی و تحلیل عمیق است که نظریات و اندیشه‌های او تأثیر بسزایی بر زمینه‌های مختلف از جمله روانشناسی، ادبیات، و هنر گذاشته است.`,
        search_key: ' روانشناسی ادبیات هنر جیمزهیلمن'
    },
    {
        id: 9,
        author: 'پروفسور مایکل دیمایرز',
        price: 399_000,
        image: '/images/new-books-image/cart__img_pazhohesh.png',
        category: 'new_books',
        count: 0,
        summary: ``,
        search_key: 'پژوهشی'
    },
    {
        id: 10,
        author: 'ناظم حکمت',
        price: 99_000,
        image: '/images/new-books-image/cart__img_shamshir.png',
        category: 'new_books',
        count: 0,
        summary: `در ادبیات سیاسی «شمشیر داموکلس» از این داستان اساطیری گرفته شده که مقصود از آن در مباحث معمولی سیاسی و اجتماعی عبارت است از یک خطر حادّ، یک تهدید دائمی که همیشه موجود است و هر حرکت و واکنشی را دچار مخاطره می‌کند.`,
        search_key: 'ادبیات سیاسی اجتماعی'
    },
    {
        id: 11,
        author: 'مارک گوبه',
        price: 89_000,
        image: '/images/new-books-image/cart__img_branding.png',
        category: 'new_books',
        count: 0,
        summary: `کتاب "برندینگ عاطفی" نوشته مارک گوبه به بررسی نقش عواطف در فرآیند ساخت و تقویت برندها (برندینگ) می‌پردازد. در این کتاب، نویسنده به اهمیت ایجاد اتصالات عاطفی با مشتریان و مخاطبان در جهت ایجاد برندهای قوی و موفق می‌پردازد. او تأکید دارد که متفاوت از برندهای تجاری، برندهایی که توانسته‌اند ارتباط عاطفی با مخاطبان خود ایجاد کنند، توانمندی بیشتری برای جذب و حفظ مشتریان دارند.
        این کتاب به مواردی مانند استفاده از داستان‌ها و نقش آن‌ها در ایجاد اتصالات عاطفی، ارتباط با ارزش‌های انسانی، و نحوه ایجاد تجربیات مشتری متمرکز می‌شود. اصول و روش‌های ارتقاء برندینگ عاطفی در این کتاب مورد بررسی و تبیین قرار می‌گیرند.`,
        search_key: 'برندینگ عاطفی تجربیات ارتقا'
    },
    {
        id: 12,
        author: 'ناشناس',
        price: 109_000,
        image: '/images/new-books-image/cart__img_rahnamye.png',
        category: 'new_books',
        count: 0,
        summary: `این کتاب راهنمایی است قوی و کاربردی برای هرچه سریع تر شروع به کار کردن اعضای جدیدی که به تیم فروش و بازاریابی شبکه ای می پیوندند تا دریابند که چگونه در کمتر از 24 ساعت کار خود را شروع کنند و حتی نتیجه بگیرند. دستورالعمل هایی که در اثر پیش رو جای گرفته علم و آگاهی را با انرژی و هیجان افراد تازه وارد ترکیب می کند و آن ها را برای یافتن مشتری های حقیقی، صحبت کردن و ارائه محصول به شکلی صحیح و آشنایی با افراد مناسب دیگر آماده می سازد تا جایی که کسب و کار خود را راه بیاندازند و حتی از دوستان قدیمی تر خود پیشی بگیرند.`,
        search_key: 'هنری فرهنگی'
    }

]


let imagesBanner = [
    {
        id: 13,
        author: 'هال الرود',
        price: 100_000,
        count: 0,
        summary: 'آشنایی با افراد مناسب دیگر آماده می سازد تا جایی که کسب و کار خود را راه بیاندازند و حتی از دوستان قدیمی تر خود پیشی بگیرن',
        name: 'morning',
        src: '/images/banner-image-book/morning-book.png',
        image: '/images/banner-image-book/moorning2.jpeg'
    },
    {
        id: 14,
        author: 'الیف شافاک',
        price: 190_000,
        count: 0,
        summary: 'توضیحات ندارد',
        name: 'melate',
        src: '/images/banner-image-book/melate_eshgh_book.png',
        image: '/images/banner-image-book/melate2.jpeg'
    },
    {
        id: 15,
        author: 'پائولو کوئیلو',
        price: 199_000,
        count: 0,
        summary: 'توضیحات ندارد',
        name: 'kimya',
        src: '/images/banner-image-book/kimya-book.png',
        image: '/images/banner-image-book/kimya2.jpeg'
    }
]

let myTeam = [
    {
        id: 1,
        name: 'حسین خانی',
        src: '/images/my_team/one.webp',
        post: 'مدیر برنامه ریزی',
        telegramLink: 'https://t.me/@mehrdadSabori',
        instagramLink: 'https://www.instagram.com/mehrad.sabori_'
    },
    {
        id: 2,
        name: 'امین ابراهیمی',
        src: '/images/my_team/two.jpg',
        post: 'مدیر فروش',
        telegramLink: 'https://t.me/@mehrdadSabori',
        instagramLink: 'https://www.instagram.com/mehrad.sabori_'
    },
    {
        id: 3,
        name: 'مهرداد صبوری',
        src: '/images/my_team/three.webp',
        post: 'برنامه نویس',
        telegramLink: 'https://t.me/@mehrdadSabori',
        instagramLink: 'https://www.instagram.com/mehrad.sabori_'
    },
    {
        id: 4,
        name: 'ریحانه علیزاده',
        src: '/images/my_team/four.jpeg',
        post: 'آبدارچی',
        telegramLink: 'https://t.me/@mehrdadSabori',
        instagramLink: 'https://www.instagram.com/mehrad.sabori_'
    },
    {
        id: 5,
        name: 'علیرضا صبوری',
        src: '/images/my_team/five.jpg',
        post: 'مدیرعامل',
        telegramLink: 'https://t.me/@mehrdadSabori',
        instagramLink: 'https://www.instagram.com/mehrad.sabori_'
    },
]

let registerInput = [
    {
        id: 1,
        name: 'email',
        type: 'email',
        placeholder: 'آدرس ایمیل ...',
        pattern: '^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$',
        iconInput: 'MdEmail',
        autoComplete: 'off',
        errorMassage: 'معتبر نیست: (example@gmail.com)'
    },
    {
        id: 2,
        name: 'username',
        type: 'username',
        placeholder: 'نام کاربری ...',
        pattern: '^[a-zA-Z0-9_]{3,20}$',
        iconInput: 'FaUser',
        autoComplete: 'off',
        errorMassage: 'بین (3-20) کاراکتر فقط شامل حروف ، اعداد و (_) باشد.'
    },
    {
        id: 3,
        name: 'password',
        type: 'password',
        placeholder: 'رمز عبور ...',
        pattern: '^(?=.*[0-9])(?=.*[a-zA-Z])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,20}$',
        iconInput: 'BiSolidLockAlt',
        autoComplete: 'off',
        errorMassage: '(a-z,A-Z)،(0-9)،($%#) و حداقل 8 کاراکتر استفاده شود.'
    },
    {
        id: 4,
        name: 'confrimPassword',
        type: 'password',
        placeholder: 'تکرار رمز عبور ...',
        iconInput: 'BiSolidLockAlt',
        autoComplete: 'off',
        errorMassage: 'رمز عبور مطابقت ندارد!'
    },

]

let loginInput = [
    {
        id: 1,
        name: 'email',
        type: 'email',
        placeholder: 'آدرس ایمیل ...',
        pattern: '^\w+([\.-]?\w+)*@\w+([\.-]?\w+)*(\.\w{2,3})+$',
        iconInput: 'MdEmail',
        autoComplete: 'off',
        errorMassage: 'معتبر نیست: (example@gmail.com)'
    },
    {
        id: 3,
        name: 'password',
        type: 'password',
        placeholder: 'رمز عبور ...',
        pattern: '^(?=.*[0-9])(?=.*[a-zA-Z])(?=.*[!@#$%^&*])[a-zA-Z0-9!@#$%^&*]{8,20}$',
        iconInput: 'BiSolidLockAlt',
        autoComplete: 'off',
        errorMassage: '(a-z,A-Z)،(0-9)،($%#) و حداقل 8 کاراکتر استفاده شود.'
    }
]
export { allBooks, imagesBanner, myTeam, registerInput, loginInput }  
